---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.SetTransparency(System.UInt32)
source: html/814d5c8d-25a5-483b-c2b5-3325c37476ab.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.SetTransparency Method

set transparency

## Syntax (C#)
```csharp
public void SetTransparency(
	uint transparency
)
```

## Parameters
- **transparency** (`System.UInt32`) - transparency

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is not valid. The valid range is 0 to 255.